{
  "_name_or_path": "sshleifer/tiny-ctrl",
  "architectures": [
    "CTRLLMHeadModel"
  ],
  "attn_pdrop": 0.1,
  "dff": 2,
  "embd_pdrop": 0.1,
  "from_tf": false,
  "id2label": {
    "0": "LABEL_0"
  },
  "initializer_range": 0.02,
  "label2id": {
    "LABEL_0": 0
  },
  "layer_norm_epsilon": 1e-06,
  "model_type": "ctrl",
  "n_ctx": 128,
  "n_embd": 16,
  "n_head": 2,
  "n_layer": 2,
  "n_positions": 50000,
  "resid_pdrop": 0.1,
  "summary_activation": null,
  "summary_first_dropout": 0.1,
  "summary_proj_to_labels": true,
  "summary_type": "cls_index",
  "summary_use_proj": true,
  "transformers_version": "4.2.1",
  "use_cache": true,
  "vocab_size": 246537
}
